wyniki_10G_article/fio_results_ext4_nvme/block_size_2048/lab-sec-14/fio_seq_write_article_test_output.txt
seq_write_article_test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_write_article_test: Laying out IO file (1 file / 10240MiB)

seq_write_article_test: (groupid=0, jobs=1): err= 0: pid=57312: Sun Apr 20 14:56:08 2025
  write: IOPS=23.0k, BW=89.9MiB/s (94.3MB/s)(15.8GiB/180001msec); 0 zone resets
    slat (usec): min=2, max=5733, avg= 6.99, stdev= 3.68
    clat (usec): min=6, max=31312, avg=35.35, stdev=198.53
     lat (usec): min=19, max=31321, avg=42.34, stdev=198.94
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   27], 10.00th=[   28], 20.00th=[   28],
     | 30.00th=[   29], 40.00th=[   30], 50.00th=[   30], 60.00th=[   31],
     | 70.00th=[   31], 80.00th=[   32], 90.00th=[   33], 95.00th=[   34],
     | 99.00th=[   38], 99.50th=[   50], 99.90th=[  865], 99.95th=[ 3458],
     | 99.99th=[12387]
   bw (  KiB/s): min=  271, max=125968, per=100.00%, avg=92140.74, stdev=15156.62, samples=359
   iops        : min=   67, max=31492, avg=23035.19, stdev=3789.18, samples=359
  lat (usec)   : 10=0.01%, 20=0.03%, 50=99.48%, 100=0.24%, 250=0.05%
  lat (usec)   : 500=0.01%, 750=0.04%, 1000=0.06%
  lat (msec)   : 2=0.02%, 4=0.06%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=5.66%, sys=19.89%, ctx=4144936, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4144883,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=89.9MiB/s (94.3MB/s), 89.9MiB/s-89.9MiB/s (94.3MB/s-94.3MB/s), io=15.8GiB (17.0GB), run=180001-180001msec

Disk stats (read/write):
  nvme0n1: ios=0/4144952, sectors=0/33609652, merge=0/860, ticks=0/152723, in_queue=152769, util=67.32%